#Область ПрограммныйИнтерфейс

Процедура ДополнитьФорму(Форма) Экспорт
// ++ Глущенко А.А. доработка форм	
	ИмяФормы = Форма.ИмяФормы;	
	Если ИмяФормы  = "Документ.ЗаказПокупателя.Форма.ФормаДокумента" Тогда	
		ДобавлениеСкидкиНаФорму(Форма);
	КонецЕсли;
// -- Глущенко А.А. 	
КонецПроцедуры


Процедура ДобавлениеСкидкиНаФорму(Форма)
	 // ++ Глущенко А.А. Добавление скидки на форму и кнопки пересчитать сумму	
	 Группа = Форма.Элементы.Добавить("Скидка", Тип("ГруппаФормы"), Форма.Элементы.ГруппаШапкаЛево);
	 Группа.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	 Группа.ОтображатьЗаголовок = Ложь;	 
	 ПолеВвода = Форма.Элементы.Добавить("СогласованнаяСкидка", Тип("ПолеФормы"), Группа);
	 ПолеВвода.Вид = ВидПоляФормы.ПолеВвода;
	 ПолеВвода.ПутьКДанным = "Объект.Дз_СогласованнаяСкидка";
	 ПолеВвода.УстановитьДействие("ПриИзменении", "ПриИзмененииСогласованнаяСкидка");	 
	 Команда = Форма.Команды.Добавить("ПересчитатьСумму");
	 Команда.Действие = "КомандаПересчитатьСумму";
	 КнопкаФормы = Форма.Элементы.Добавить("КнопкаПересчитатьСумму", Тип("КнопкаФормы"), Группа); 
	 КнопкаФормы.ИмяКоманды = "ПересчитатьСумму";
	 КнопкаФормы.Вид = ВидКнопкиФормы.ОбычнаяКнопка;
	 // -- Глущенко А.А. 	
КонецПроцедуры

 #КонецОбласти